hum/app/controllers/daum_albums_controller.rb

  def index
    @daum_albums = DaumAlbum.all
---
SELECT "daum_albums".* FROM "daum_albums"

  def create
    @daum_album = DaumAlbum.new(daum_album_params)

    respond_to do |format|
      if @daum_album.save
---
INSERT INTO "daum_albums" ("artist", "created_at", "image_name", "review", "review_writer", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @daum_album.destroy
---
DELETE FROM "daum_albums" WHERE "daum_albums"."id" = ?  [["id", 980190962]]

    def set_daum_album
      @daum_album = DaumAlbum.find(params[:id])
---
SELECT "daum_albums".* FROM "daum_albums" WHERE "daum_albums"."id" = ? LIMIT 1  [["id", "980190962"]]